{
        "intents": [
                {
                        "tag": "greeting",
                        "patterns": [
                                "வணக்கம்!"
                        ],
                        "responses": [
                                "வரவேற்பு!",
                                "உங்களை சந்தித்ததற்கு மிக்க மகிழ்ச்சி",
                                "உங்களை மீண்டும் சந்திப்பது நல்லது"
                        ],
                        "context_set": ""
                },
                {
                        "tag": "goodbye",
                        "patterns": [
                                "பிரியாவிடை",
                                "நன்றி"
                        ],
                        "responses": [
                                "மிக்க நன்றி!",
                                "பிறகு சந்திப்போம்!",
                                "மீண்டும் வருக"
                        ]
                },
                {
                
                        "tag": "chatbot",
                        "patterns": [
                                "இந்த அரட்டை போட்டை உருவாக்கியது யார்",
                                "இந்த அரட்டை போட் பற்றி சொல்லுஙள்"
                        ],
                        "responses": [
                                "இந்த அரட்டை போட் மனிதனால் உருவாக்கப்பட்டது,மனித இனத்தின் முன்னேற்றத்திற்காக",
                                "தொழில்நுட்பம் தொடர்பான ஏதேனும் கேள்விகளை நீங்கள் என்னிடம் கேட்கலாம்"
                        ]
                },
          {
                
                        "tag": "transport_definition",
                        "patterns": [
                                "போக்குவரத்து என்றால் என்ன",
                                "போக்குவரத்து"
                        ],
                        "responses": [
                                "போக்குவரத்து என்பது மனிதர்கள், விலங்குகள் மற்றும் பொருட்களை ஒரு இடத்திலிருந்து மற்றொரு இடத்திற்கு வேண்டுமென்றே நகர்த்துவதாகும், அதற்கான சில போக்குவரத்து முறைகளும் உள்ளன."
                        ]
                },
          {
                
                        "tag": "transport_modes",
                        "patterns": [
                                "போக்குவரத்து முறைகள் என்ன"
                        ],
                        "responses": [
                                "மொத்தம் நான்கு போக்குவரத்து முறைகள் உள்ளன. காற்று வழி, நீர் வழி, சாலை வழி, வானம் வழி. ஒவ்வொரு பயன்முறையும் வெவ்வேறு பயன்பாடுகளுக்குப் பயன்படுத்தப்படுகிறது."
                        ]
                },
          {
                
                        "tag": "road ways",
                        "patterns": [
                                "சாலை வழி என்றால் என்ன"
                        ],
                        "responses": [
                                "ஒரு சாலை என்பது போக்குவரத்தை கடத்துவதற்கான ஒரு நேரியல் வழியாகும், இது பெரும்பாலும் வாகனங்கள் மற்றும் பாதசாரிகளின் பயன்பாட்டிற்காக மேம்படுத்தப்பட்ட மேற்பரப்பைக் கொண்டுள்ளது. தெருக்களைப் போலன்றி, சாலைகளின் முக்கிய செயல்பாடு போக்குவரத்து ஆகும்."
                        ]
                },
          {
                
                        "tag": "water ways",
                        "patterns": [
                                "நீர் வழி என்றால் என்ன"
                        ],
                        "responses": [
                                "நீர்வழி என்பது செல்லக்கூடிய எந்தவொரு நீர்நிலையாகும். தெளிவின்மையைத் தவிர்க்க பரந்த வேறுபாடுகள் பயனுள்ளதாக இருக்கும், மேலும் பிற மொழிகளில் சமமான வார்த்தையின் நுணுக்கத்தைப் பொறுத்து தெளிவின்மை வேறுபட்ட முக்கியத்துவம் வாய்ந்ததாக இருக்கும். கடல்வழி கப்பல் வழித்தடங்கள் மற்றும் உள்நாட்டு நீர் கிராஃப்ட் பயன்படுத்தப்படும் நீர்வழிகள் இடையே முதல் வேறுபாடு அவசியம்."
                        ]
                },
          {
                
                        "tag": "air ways",
                        "patterns": [
                                "காற்று வழி என்றால் என்ன"
                        ],
                        "responses": [
                                "விமானப் போக்குவரத்து என்பது விமானங்கள், ஜெட் விமானங்கள், ராக்கெட் ஹெலிகாப்டர்கள் மற்றும் ட்ரோன்கள் ஆகியவற்றைப் பயன்படுத்தி பயணிகள் மற்றும் சரக்குகளை ஒரு இடத்திலிருந்து மற்றொரு இடத்திற்கு கொண்டு செல்வதற்கான ஒரு விமான வடிவமைப்பாகும். இந்த வகை விமானப் போக்குவரத்து ஒவ்வொன்றும் வேகத்தை அடைவதற்கான தனித்துவமான வழியையும் அதன் பயணத்தின் நிலைத்தன்மையையும் கொண்டுள்ளது."
                        ]
                },
          {
                
                        "tag": "space ways",
                        "patterns": [
                                "விண்வெளி வழி என்றால் என்ன"
                        ],
                        "responses": [
                                "விண்வெளி போக்குவரத்து அமைப்பு, NASA இன் உள்நாட்டில் ஒருங்கிணைந்த திட்டத் திட்டம் என்றும் அறியப்படுகிறது, இது அப்பல்லோ திட்டத்திற்கு அப்பால் நீட்டிக்கப்பட்ட செயல்பாடுகளை ஆதரிக்க 1969 இல் கற்பனை செய்யப்பட்ட மறுபயன்பாட்டு குழு விண்வெளி வாகனங்களின் முன்மொழியப்பட்ட அமைப்பாகும். இந்த அமைப்பின் நோக்கம் இரண்டு மடங்கு ஆகும்: செலவழிக்கக்கூடிய ராக்கெட்டுகளில் காப்ஸ்யூல்களை அனுப்பும் தற்போதைய முறையை மறுபயன்பாட்டு விண்கலத்துடன் மாற்றுவதன் மூலம் விண்வெளிப் பயணத்தின் செலவைக் குறைப்பது."
                        ]
                },
                {
                        "tag": "location",
                        "patterns": [
                                "இது என்ன இடம்",
                                "நாம் இப்போது எங்கே இருக்கிறோம்",
                                "நாம் இப்போது வசிக்கும் இந்த இடத்தின் பெயர் என்ன"
                        ],
                        "responses": [
                                "இந்த இடம் கோயம்புத்தூர் மாவட்டம்",
                                "நாம் அனைவரும் தற்போது இந்தியாவில் வசிக்கிறோம்"
                        ]
                }
        ]
}